IDENTIFICATION DIVISION.
   PROGRAM-ID. IMC.
AUTHOR. Eric Varjao.                                          
 
ENVIRONMENT DIVISION.

DATA DIVISION.
 WORKING-STORAGE SECTION.
 
01 ALTURA    PIC 9V99.
01 PESO      PIC 999.
01 IMC-TOTAL PIC ZZ9.99. 
   
PROCEDURE DIVISION.
PRINCIPAL.
     DISPLAY "Entre com sua altura (em Mt):".
     ACCEPT ALTURA.
     DISPLAY "Entre com o seu peso (em Kg):".
     ACCEPT PESO.
     
    COMPUTE IMC-TOTAL = PESO / (ALTURA ** 2).
   DISPLAY "Seu IMC e " IMC-TOTAL.
   
     STOP RUN.
END PROGRAM IMC.
